bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAME51_DFP/1.1.139/atdf/ATSAME51J19A.atdf
<?xml version="1.0" encoding="UTF-8"?>
<!--
 Copyright (c) 2018 Microchip Technology Inc.

 SPDX-License-Identifier: Apache-2.0

 Licensed under the Apache License, Version 2.0 (the "License");
 you may not use this file except in compliance with the License.
 You may obtain a copy of the License at

 http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing, software
 distributed under the License is distributed on an "AS IS" BASIS,
 WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 See the License for the specific language governing permissions and
 limitations under the License.
-->
<avr-tools-device-file xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="4.4" xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd">
  <file timestamp="2019-07-15T21:34:36Z"/>
  <variants xmlns:mhc="http://www.atmel.com/schemas/avr-tools-device-file/mhc">
    <variant ordercode="SAME51J19A-MU" mhc:ordercode="ATSAME51J19A-MU" package="QFN64" pinout="SAMD51J" speedmax="120000000" tempmin="-40" tempmax="85" vccmin="1.71" vccmax="3.60"/>
    <variant ordercode="SAME51J19A-MF" mhc:ordercode="ATSAME51J19A-MF" package="QFN64" pinout="SAMD51J" speedmax="100000000" tempmin="-40" tempmax="125" vccmin="1.71" vccmax="3.60"/>
    <variant ordercode="SAME51J19A-MZ" mhc:ordercode="ATSAME51J19A-MZ" package="QFN64" pinout="SAMD51J" speedmax="100000000" tempmin="-40" tempmax="125" vccmin="1.71" vccmax="3.60"/>
    <variant ordercode="SAME51J19A-AU" mhc:ordercode="ATSAME51J19A-AU" package="TQFP64" pinout="SAMD51J" speedmax="120000000" tempmin="-40" tempmax="85" vccmin="1.71" vccmax="3.60"/>
    <variant ordercode="SAME51J19A-AF" mhc:ordercode="ATSAME51J19A-AF" package="TQFP64" pinout="SAMD51J" speedmax="100000000" tempmin="-40" tempmax="125" vccmin="1.71" vccmax="3.60"/>
    <variant ordercode="SAME51J19A-AZ" mhc:ordercode="ATSAME51J19A-AZ" package="TQFP64" pinout="SAMD51J" speedmax="100000000" tempmin="-40" tempmax="125" vccmin="1.71" vccmax="3.60"/>
  </variants>
  <devices>
    <device name="ATSAME51J19A" architecture="CORTEX-M4" family="SAME" series="SAME51">
      <address-spaces>
        <address-space id="base" name="base" start="0" size="0x100000000" endianness="little">
          <memory-segment name="FLASH" start="0x00000000" size="0x80000" type="flash" pagesize="512" rw="RW" exec="true"/>
          <memory-segment name="SW0" start="0x00800080" size="0x10" type="fuses" rw="R"/>
          <memory-segment name="TEMP_LOG" start="0x00800100" size="0x200" type="fuses" pagesize="512" rw="RW"/>
          <memory-segment name="USER_PAGE" start="0x00804000" size="0x200" type="user_page" pagesize="512" rw="RW"/>
          <memory-segment name="CMCC" start="0x03000000" size="0x1000000" type="io" rw="RW"/>
          <memory-segment name="CMCC_DATARAM" start="0x3000000" size="0x1000" type="io" rw="RW"/>
          <memory-segment name="CMCC_TAGRAM" start="0x3001000" size="0x400" type="io" rw="RW"/>
          <memory-segment name="CMCC_VALIDRAM" start="0x3002000" size="0x40" type="io" rw="RW"/>
          <memory-segment name="QSPI" start="0x04000000" size="0x1000000" type="other" rw="RW" exec="true" external="true"/>
          <memory-segment name="HSRAM" start="0x20000000" size="0x30000" type="ram" rw="RW" exec="true"/>
          <memory-segment name="HSRAM_ETB" start="0x20000000" size="0x8000" type="ram" rw="RW" exec="true"/>
          <memory-segment name="HSRAM_RET1" start="0x20000000" size="0x8000" type="ram" rw="RW" exec="true"/>
          <memory-segment name="HPB0" start="0x40000000" size="0x4400" type="io" rw="RW"/>
          <memory-segment name="HPB1" start="0x41000000" size="0x22000" type="io" rw="RW"/>
          <memory-segment name="HPB2" start="0x42000000" size="0x3C00" type="io" rw="RW"/>
          <memory-segment name="HPB3" start="0x43000000" size="0x3000" type="io" rw="RW"/>
          <memory-segment name="SEEPROM" start="0x44000000" size="0x20000" type="io" rw="RW"/>
          <memory-segment name="SDHC0" start="0x45000000" size="0xC00" type="io" rw="RW"/>
          <memory-segment name="BKUPRAM" start="0x47000000" size="0x2000" type="ram" rw="RW" exec="true"/>
          <memory-segment name="PPB" start="0xE0000000" size="0x100000" type="io" rw="RW"/>
          <memory-segment name="SCS" start="0xE000E000" size="0x00001000" type="io" rw="RW"/>
          
        </address-space>
        <address-space id="fuses" name="fuses" start="0x00000000" size="0x20000000" endianness="little"/>
      </address-spaces>
      <parameters>
        <param name="GCLK_ID_TRACE" value="47" caption="Index of Trace Generic Clock"/>
        <param name="NUM_IRQ" value="137" caption="Number of interrupt request lines"/>
        <param name="__CM4_REV" value="0x0001" caption="Cortex-M4 Core Revision"/>
        <param name="__DEBUG_LVL" value="3" caption="Debug Level"/>
        <param name="__FPU_PRESENT" value="1" caption="FPU present or not"/>
        <param name="__MPU_PRESENT" value="1" caption="MPU present or not"/>
        <param name="__NVIC_PRIO_BITS" value="3" caption="Number of Bits used for Priority Levels"/>
        <param name="__TRACE_LVL" value="2" caption="Trace Level"/>
        <param name="__VTOR_PRESENT" value="1" caption="Vector Table Offset Register present or not"/>
        <param name="__Vendor_SysTickConfig" value="0" caption="Set to 1 if different SysTick Config is used"/>
        <param name="__ARCH_ARM" value="1"/>
        <param name="__ARCH_ARM_CORTEX_M" value="1"/>
        <param name="__DEVICE_IS_SAM" value="1"/>
      </parameters>
      <peripherals>
        <module name="AC" id="U2501" version="1.0.0">
          <instance name="AC">
            <register-group name="AC" name-in-module="AC" address-space="base" offset="0x42002000"/>
            <signals>
              <signal group="AIN" index="0" function="B" pad="PA04"/>
              <signal group="AIN" index="1" function="B" pad="PA05"/>
              <signal group="AIN" index="2" function="B" pad="PA06"/>
              <signal group="AIN" index="3" function="B" pad="PA07"/>
              <signal group="CMP" index="0" function="M" pad="PA12" ioset="1"/>
              <signal group="CMP" index="0" function="M" pad="PA18" ioset="2"/>
              <signal group="CMP" index="1" function="M" pad="PA13" ioset="1"/>
              <signal group="CMP" index="1" function="M" pad="PA19" ioset="2"/>
            </signals>
            <parameters>
              <param name="COMPCTRL_MUXNEG_OPAMP" value="7" caption="OPAMP selection for MUXNEG"/>
              <param name="GCLK_ID" value="32" caption="Index of Generic Clock"/>
              <param name="IMPLEMENTS_VDBLR" value="0" caption="VDoubler implemented ?"/>
              <param name="NUM_CMP" value="2" caption="Number of comparators"/>
              <param name="PAIRS" value="1" caption="Number of pairs of comparators"/>
              <param name="SPEED_LEVELS" value="2" caption="Number of speed values"/>
              <param name="INSTANCE_ID" value="72"/>
            </parameters>
          </instance>
        </module>
        <module name="ADC" id="U2500" version="1.0.0">
          <instance name="ADC0">
            <register-group name="ADC0" name-in-module="ADC" address-space="base" offset="0x43001C00"/>
            <signals>
              <signal group="AIN" index="0" function="B" pad="PA02"/>
              <signal group="AIN" index="1" function="B" pad="PA03"/>
              <signal group="AIN" index="2" function="B" pad="PB08"/>
              <signal group="AIN" index="3" function="B" pad="PB09"/>
              <signal group="AIN" index="4" function="B" pad="PA04"/>
              <signal group="AIN" index="5" function="B" pad="PA05"/>
              <signal group="AIN" index="6" function="B" pad="PA06"/>
              <signal group="AIN" index="7" function="B" pad="PA07"/>
              <signal group="AIN" index="8" function="B" pad="PA08"/>
              <signal group="AIN" index="9" function="B" pad="PA09"/>
              <signal group="AIN" index="10" function="B" pad="PA10"/>
              <signal group="AIN" index="11" function="B" pad="PA11"/>
              <signal group="AIN" index="12" function="B" pad="PB00"/>
              <signal group="AIN" index="13" function="B" pad="PB01"/>
              <signal group="AIN" index="14" function="B" pad="PB02"/>
              <signal group="AIN" index="15" function="B" pad="PB03"/>
              <signal group="X" index="0" function="B" pad="PA03"/>
              <signal group="Y" index="0" function="B" pad="PA03"/>
              <signal group="X" index="1" function="B" pad="PB08"/>
              <signal group="Y" index="1" function="B" pad="PB08"/>
              <signal group="X" index="2" function="B" pad="PB09"/>
              <signal group="Y" index="2" function="B" pad="PB09"/>
              <signal group="X" index="3" function="B" pad="PA04"/>
              <signal group="Y" index="3" function="B" pad="PA04"/>
              <signal group="X" index="4" function="B" pad="PA06"/>
              <signal group="Y" index="4" function="B" pad="PA06"/>
              <signal group="X" index="5" function="B" pad="PA07"/>
              <signal group="Y" index="5" function="B" pad="PA07"/>
              <signal group="X" index="6" function="B" pad="PA08"/>
              <signal group="Y" index="6" function="B" pad="PA08"/>
              <signal group="X" index="7" function="B" pad="PA09"/>
              <signal group="Y" index="7" function="B" pad="PA09"/>
              <signal group="X" index="8" function="B" pad="PA10"/>
              <signal group="Y" index="8" function="B" pad="PA10"/>
              <signal group="X" index="9" function="B" pad="PA11"/>
              <signal group="Y" index="9" function="B" pad="PA11"/>
              <signal group="X" index="10" function="B" pad="PA16"/>
              <signal group="Y" index="10" function="B" pad="PA16"/>
              <signal group="X" index="11" function="B" pad="PA17"/>
              <signal group="Y" index="11" function="B" pad="PA17"/>
              <signal group="X" index="12" function="B" pad="PA18"/>
              <signal group="Y" index="12" function="B" pad="PA18"/>
              <signal group="X" index="13" function="B" pad="PA19"/>
              <signal group="Y" index="13" function="B" pad="PA19"/>
              <signal group="X" index="14" function="B" pad="PA20"/>
              <signal group="Y" index="14" function="B" pad="PA20"/>
              <signal group="X" index="15" function="B" pad="PA21"/>
              <signal group="Y" index="15" function="B" pad="PA21"/>
              <signal group="X" index="16" function="B" pad="PA22"/>
              <signal group="Y" index="16" function="B" pad="PA22"/>
              <signal group="X" index="17" function="B" pad="PA23"/>
              <signal group="Y" index="17" function="B" pad="PA23"/>
              <signal group="X" index="18" function="B" pad="PA27"/>
              <signal group="Y" index="18" function="B" pad="PA27"/>
              <signal group="X" index="19" function="B" pad="PA30"/>
              <signal group="Y" index="19" function="B" pad="PA30"/>
              <signal group="X" index="20" function="B" pad="PB02"/>
              <signal group="Y" index="20" function="B" pad="PB02"/>
              <signal group="X" index="21" function="B" pad="PB03"/>
              <signal group="Y" index="21" function="B" pad="PB03"/>
              <signal group="X" index="22" function="B" pad="PB04"/>
              <signal group="Y" index="22" function="B" pad="PB04"/>
              <signal group="X" index="23" function="B" pad="PB05"/>
              <signal group="Y" index="23" function="B" pad="PB05"/>
              <signal group="X" index="24" function="B" pad="PB06"/>
              <signal group="Y" index="24" function="B" pad="PB06"/>
              <signal group="X" index="25" function="B" pad="PB07"/>
              <signal group="Y" index="25" function="B" pad="PB07"/>
              <signal group="X" index="26" function="B" pad="PB12"/>
              <signal group="Y" index="26" function="B" pad="PB12"/>
              <signal group="X" index="27" function="B" pad="PB13"/>
              <signal group="Y" index="27" function="B" pad="PB13"/>
              <signal group="X" index="28" function="B" pad="PB14"/>
              <signal group="Y" index="28" function="B" pad="PB14"/>
              <signal group="X" index="29" function="B" pad="PB15"/>
              <signal group="Y" index="29" function="B" pad="PB15"/>
              <signal group="X" index="30" function="B" pad="PB00"/>
              <signal group="Y" index="30" function="B" pad="PB00"/>
              <signal group="X" index="31" function="B" pad="PB01"/>
              <signal group="Y" index="31" function="B" pad="PB01"/>
            </signals>
            <parameters>
              <param name="BANDGAP" value="27" caption="MUXPOS value to select BANDGAP"/>
              <param name="CTAT" value="29" caption="MUXPOS value to select CTAT"/>
              <param name="DMAC_ID_RESRDY" value="68" caption="index of DMA RESRDY trigger"/>
              <param name="DMAC_ID_SEQ" value="69" caption="Index of DMA SEQ trigger"/>
              <param name="EXTCHANNEL_MSB" value="15" caption="Number of external channels"/>
              <param name="GCLK_ID" value="40" caption="index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="1" caption="ADC Master/Slave Mode"/>
              <param name="OPAMP2" value="0" caption="MUXPOS value to select OPAMP2"/>
              <param name="OPAMP01" value="0" caption="MUXPOS value to select OPAMP01"/>
              <param name="PTAT" value="28" caption="MUXPOS value to select PTAT"/>
              <param name="TOUCH_IMPLEMENTED" value="1" caption="TOUCH implemented or not"/>
              <param name="TOUCH_LINES_NUM" value="32" caption="Number of touch lines"/>
              <param name="INSTANCE_ID" value="103"/>
            </parameters>
          </instance>
          <instance name="ADC1">
            <register-group name="ADC1" name-in-module="ADC" address-space="base" offset="0x43002000"/>
            <signals>
              <signal group="AIN" index="0" function="B" pad="PB08"/>
              <signal group="AIN" index="1" function="B" pad="PB09"/>
              <signal group="AIN" index="2" function="B" pad="PA08"/>
              <signal group="AIN" index="3" function="B" pad="PA09"/>
              <signal group="AIN" index="6" function="B" pad="PB04"/>
              <signal group="AIN" index="7" function="B" pad="PB05"/>
              <signal group="AIN" index="8" function="B" pad="PB06"/>
              <signal group="AIN" index="9" function="B" pad="PB07"/>
            </signals>
            <parameters>
              <param name="BANDGAP" value="27" caption="MUXPOS value to select BANDGAP"/>
              <param name="CTAT" value="29" caption="MUXPOS value to select CTAT"/>
              <param name="DMAC_ID_RESRDY" value="70" caption="Index of DMA RESRDY trigger"/>
              <param name="DMAC_ID_SEQ" value="71" caption="Index of DMA SEQ trigger"/>
              <param name="EXTCHANNEL_MSB" value="15" caption="Number of external channels"/>
              <param name="GCLK_ID" value="41" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="2" caption="ADC Master/Slave Mode"/>
              <param name="OPAMP2" value="0" caption="MUXPOS value to select OPAMP2"/>
              <param name="OPAMP01" value="0" caption="MUXPOS value to select OPAMP01"/>
              <param name="PTAT" value="28" caption="MUXPOS value to select PTAT"/>
              <param name="TOUCH_IMPLEMENTED" value="0" caption="TOUCH implemented or not"/>
              <param name="TOUCH_LINES_NUM" value="1" caption="Number of touch lines"/>
              <param name="INSTANCE_ID" value="104"/>
            </parameters>
          </instance>
        </module>
        <module name="AES" id="U2238" version="2.2.0">
          <instance name="AES">
            <register-group name="AES" name-in-module="AES" address-space="base" offset="0x42002400"/>
            <parameters>
              <param name="DMAC_ID_RD" value="82" caption="DMA DATA Read trigger"/>
              <param name="DMAC_ID_WR" value="81" caption="DMA DATA Write trigger"/>
              <param name="FOUR_BYTE_OPERATION" value="1" caption="Byte Operation"/>
              <param name="GCM" value="1" caption="GCM"/>
              <param name="KEYLEN" value="2" caption="Key Length"/>
              <param name="INSTANCE_ID" value="73"/>
            </parameters>
          </instance>
        </module>
